#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=3385a423-41d5-4957-9beb-f65f0f0a4bfa]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # openstack_compute_instance_v2.cloud-info has been deleted
  - resource "openstack_compute_instance_v2" "cloud-info" {
      - access_ip_v4        = "192.168.1.217" -> null
      - all_metadata        = {} -> null
      - all_tags            = [] -> null
      - availability_zone   = "nova" -> null
      - flavor_id           = "737f8483-8063-4567-a8e5-e09a4bcbdb49" -> null
      - flavor_name         = "svc1.m" -> null
      - force_delete        = false -> null
      - id                  = "3385a423-41d5-4957-9beb-f65f0f0a4bfa" -> null
      - image_id            = "97624935-200f-4670-9ea8-c65282adbe56" -> null
      - image_name          = "ubuntu-18.04-amd64-raw" -> null
      - name                = "cloud-info" -> null
      - power_state         = "active" -> null
      - security_groups     = [
          - "default",
        ] -> null
      - stop_before_destroy = false -> null
      - user_data           = "b69e372378f82fbc480bf784f1c4490ef01980f5" -> null

      - network {
          - access_network = false -> null
          - fixed_ip_v4    = "192.168.1.217" -> null
          - mac            = "fa:16:3e:a6:2d:8a" -> null
          - name           = "cloud_egi_net" -> null
          - uuid           = "f15a0e1f-570e-4135-9739-a59b8c2b3e8e" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info will be created
  + resource "openstack_compute_instance_v2" "cloud-info" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = "737f8483-8063-4567-a8e5-e09a4bcbdb49"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "97624935-200f-4670-9ea8-c65282adbe56"
      + image_name          = (known after apply)
      + name                = "cloud-info"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "751fc8031e991a3a48a6f45609f90cca035f1f4e"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "f15a0e1f-570e-4135-9739-a59b8c2b3e8e"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*